MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RoveI2C/RoveI2C_TivaTM4C1294NCPDT.cpp
  // Wait for the I2C module to be ready.
  while(!SysCtlPeripheralReady(i2cPeriph));

  //reset the i2c module -- in case of re-initialization
  SysCtlPeripheralReset(i2cPeriph);

  // Wait for the I2C module to be ready.
  while(!SysCtlPeripheralReady(i2cPeriph));

  //enable gpio module
  SysCtlPeripheralEnable(dataPinPortPeriph);
  SysCtlPeripheralEnable(clockPinPortPeriph);
  while(!SysCtlPeripheralReady(dataPinPortPeriph) || !SysCtlPeripheralReady(clockPinPortPeriph));

  //configure the gpio pins for using the i2c module as a source
  GPIOPinConfigure(pinMapToI2cConfig[clockPin]);
  GPIOPinConfigure(pinMapToI2cConfig[dataPin]);

  //configure the gpio pins for i2c operation
  GPIOPinTypeI2CSCL(clockPinPortBase, pinToPinMask[clockPin]);
  GPIOPinTypeI2C(dataPinPortBase, pinToPinMask[dataPin]);

  //set default timeout value to as high as possible
  I2CMasterTimeoutSet(i2cBase, 0xFF);

  // Enable and initialize the I2C0 master module. 
  masterInitExpClk(i2cBase, speed);

  //clear I2C FIFOs
  HWREG(i2cBase + I2C_O_FIFOCTL) = 80008000;

  if(I2CMasterBusBusy(i2cBase) || I2CMasterErr(i2cBase))
  {
    for(int i = 0; i < 10; i++)
    {
      digitalPinWrite(clockPin, HIGH);
      delayMicroseconds(5);
      digitalPinWrite(clockPin, LOW);
      delayMicroseconds(5);
    }
  }

  RoveI2C_Handle handle;
  handle.index = i2cIndex;
  handle.initialized = true;
  handle.clockPin = clockPin;
  handle.dataPin = dataPin;
  handle.speed = speed;

  return handle;
}

RoveI2C_Error roveI2cSend(RoveI2C_Handle handle, uint16_t SlaveAddr, uint8_t msg)
{
  if(!handle.initialized)
  {
    debugFault("roveI2cSend: handle not initialized");
  }

  uint32_t i2cBase = i2cIndexToI2cBase[handle.index];
  bool receive = false;

  //slave address is bits 6:0 of byte
  SlaveAddr &= 0b01111111;

  // Tell the master module what address it will place on the bus when
  // communicating with the slave.
  I2CMasterSlaveAddrSet(i2cBase, SlaveAddr, receive);

  //if another master is using the bus, return that the line is busy
  if(I2CMasterBusBusy(i2cBase))
  {
    i2cErrorReset(handle);
    return(I2CERROR_BUSY);
  }

  //put data to be sent into FIFO
  I2CMasterDataPut(i2cBase, msg);

  //Initiate send of data from the MCU
  I2CMasterControl(i2cBase, I2C_MASTER_CMD_SINGLE_SEND);

  //do data transfer with slave
  return transferHandleError(i2cBase);
}

RoveI2C_Error roveI2cSendReg(RoveI2C_Handle handle, uint16_t SlaveAddr, uint8_t reg, uint8_t msg)
{
  uint8_t compactedMsg[2];
  compactedMsg[0] = reg;
  compactedMsg[1] = msg;

  return(roveI2cSendBurst(handle, SlaveAddr, compactedMsg, 2));
}

RoveI2C_Error roveI2cSendBurst(RoveI2C_Handle handle, uint16_t SlaveAddr, uint8_t msg[], size_t msgSize)
{
  if(!handle.initialized)
  {
    debugFault("roveI2cSendBurst: handle not initialized");
  }

  uint32_t i2cBase = i2cIndexToI2cBase[handle.index];
  bool receive = false;
  RoveI2C_Error errorGot;

  //slave address is bits 6:0 of byte
  SlaveAddr = SlaveAddr & 0b01111111;

  if(msgSize == 1)
  {
    return roveI2cSend(handle, SlaveAddr, msg[0]);
  }

  // Tell the master module what address it will place on the bus when
  // communicating with the slave.
  I2CMasterSlaveAddrSet(i2cBase, SlaveAddr, receive);

  //if another master is using the bus, return that the line is busy
  if(I2CMasterBusBusy(i2cBase))
  {
    i2cErrorReset(handle);
    return(I2CERROR_BUSY);
  }

  //send more of the data, up till the last byte, using the
  //BURST_SEND_CONT command of the I2C module
  for(uint32_t i = 0; i < msgSize; i++)
  {
    //put next piece of data into I2C FIFO
    I2CMasterDataPut(i2cBase, msg[i]);

    //send next data that was just placed into FIFO
    if(i == 0)
    {
      I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_SEND_START);
    }
    else if(i == msgSize - 1)
    {
      //send next data that was just placed into FIFO
      I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_SEND_FINISH);
    }
    else
    {
      I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_SEND_CONT);
    }

    //do data transfer with slave
    errorGot = transferHandleError(i2cBase, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);
    if(errorGot != I2CERROR_NONE)
    {
      i2cErrorReset(handle);
      return errorGot;
    }
  }

  return I2CERROR_NONE;
}

RoveI2C_Error roveI2cSendBurstReg(RoveI2C_Handle handle, uint16_t SlaveAddr, uint8_t reg, uint8_t msg[], size_t msgSize)
{
  //make an array big enough to hold the message plus the register address
  uint8_t compactedMsg[msgSize+1];

  //transfer data array into the compacted message array, with the first element being the reg and all elements after being the msg array concacted on
  compactedMsg[0] = reg;
  for(int i = 0; i < msgSize; i++)
  {
    compactedMsg[i+1] = msg[i];
  }

  //call the multi byte send function. It will send the register address first, followed by the actual message
  return roveI2cSendBurst(handle, SlaveAddr, compactedMsg, msgSize+1);
}

RoveI2C_Error roveI2cReceive(RoveI2C_Handle handle, uint16_t SlaveAddr, uint8_t* buffer)
{
  if(!handle.initialized)
  {
    debugFault("roveI2cReceive: handle not initialized");
  }

  uint32_t i2cBase = i2cIndexToI2cBase[handle.index];
  bool receive = true;
  RoveI2C_Error errorGot;

  //slave address is bits 6:0 of byte
  SlaveAddr = SlaveAddr & 0b01111111;

  //specify that we are going to read from slave device with 3rd argument = true
  I2CMasterSlaveAddrSet(i2cBase, SlaveAddr, receive);

  //if another master is using the bus, return that the line is busy
  if(I2CMasterBusBusy(i2cBase))
  {
    i2cErrorReset(handle);
    return(I2CERROR_BUSY);
  }

  //send control byte and read from the register we specified earlier
  I2CMasterControl(i2cBase, I2C_MASTER_CMD_SINGLE_RECEIVE);

  //do data transfer with slave
  errorGot = transferHandleError(i2cBase);
  if(errorGot == I2CERROR_NONE)
  {
    //return data pulled from the specified register, returns uint32_t even though it only contains a byte
    *buffer = I2CMasterDataGet(i2cBase);
  }
  return errorGot;
}

RoveI2C_Error roveI2cReceiveReg(RoveI2C_Handle handle, uint16_t SlaveAddr, uint8_t reg, uint8_t* buffer)
{
  if(!handle.initialized)
  {
    debugFault("roveI2cReceive: handle not initialized");
  }

  uint32_t i2cBase = i2cIndexToI2cBase[handle.index];

