MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RoveI2C/RoveI2C_TivaTM4C1294NCPDT.cpp
  bool receive = false;
  RoveI2C_Error errorGot;

  //specify that we are writing (a register address) to the
  //slave device
  I2CMasterSlaveAddrSet(i2cBase, SlaveAddr, receive);

  //if another master is using the bus, return that the line is busy
  if(I2CMasterBusBusy(i2cBase))
  {
    i2cErrorReset(handle);
    return(I2CERROR_BUSY);
  }

  //specify register to be read on the slave device
  I2CMasterDataPut(i2cBase, reg);

  //send control byte and register address byte to slave device
  //say we're sending a burst for some intricate i2c protocol-y reason.
  I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_SEND_START);

  //do data transfer with slave
  errorGot = transferHandleError(i2cBase, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);
  if(errorGot != I2CERROR_NONE)
  {
    i2cErrorReset(handle);
    return errorGot;
  }

  receive = true;

  //specify that we are going to read from slave device
  I2CMasterSlaveAddrSet(i2cBase, SlaveAddr, receive);

  //send control byte and read from the register we specified earlier
  I2CMasterControl(i2cBase, I2C_MASTER_CMD_SINGLE_RECEIVE);

  //do data transfer with slave
  errorGot = transferHandleError(i2cBase);
  if(errorGot == I2CERROR_NONE)
  {
     //return data pulled from the specified register, returns uint32_t even though it only contains a byte
     *buffer = I2CMasterDataGet(i2cBase);
  }
  return errorGot;
}

RoveI2C_Error roveI2cReceiveBurst(RoveI2C_Handle handle, uint16_t SlaveAddr, uint8_t* buffer, size_t sizeOfReceive)
{
  if(!handle.initialized)
  {
    debugFault("roveI2cReceiveBurst: handle not initialized");
  }

  uint8_t * receivedData = buffer;
  uint32_t i2cBase = i2cIndexToI2cBase[handle.index];
  bool receive = true;
  RoveI2C_Error errorGot;

  if(sizeOfReceive == 0)
  {
    return I2CERROR_NONE;
  }
  else if(sizeOfReceive == 1)
  {
    return roveI2cReceive(handle, SlaveAddr, buffer);
  }

  //specify that we are going to read from slave device
  I2CMasterSlaveAddrSet(i2cBase, SlaveAddr, receive);

  //if another master is using the bus, return that the line is busy
  if(I2CMasterBusBusy(i2cBase))
  {
    i2cErrorReset(handle);
    return(I2CERROR_BUSY);
  }

  for(uint32_t i = 0; i < sizeOfReceive; i++)
  {
    //receive control byte and read from the register we specified earlier
    if(i == 0)
    {
      I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_RECEIVE_START);
    }
    else if(i == sizeOfReceive - 1)
    {
      //finish transfer
      I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_RECEIVE_FINISH);
    }
    else
    {
      I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_RECEIVE_CONT);
    }
    
    //do data transfer with slave
    errorGot = transferHandleError(i2cBase, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);
    if(errorGot != I2CERROR_NONE)
    {
      i2cErrorReset(handle);
      return errorGot;
    }
    else
    {
      //return data pulled from specified register
      receivedData [i] = I2CMasterDataGet(i2cBase);
    }
  }

  return I2CERROR_NONE;
}

RoveI2C_Error roveI2cReceiveBurstReg(RoveI2C_Handle handle, uint16_t SlaveAddr,  uint8_t reg, uint8_t* buffer, size_t sizeOfReceive)
{
  if(!handle.initialized)
  {
    debugFault("roveI2cReceiveBurst: handle not initialized");
  }

  uint8_t* receivedData = buffer;
  uint32_t i2cBase = i2cIndexToI2cBase[handle.index];
  bool receive = false;
  RoveI2C_Error errorGot;

  if(sizeOfReceive == 0)
  {
    return I2CERROR_NONE;
  }
  else if(sizeOfReceive == 1)
  {
    return roveI2cReceiveReg(handle, SlaveAddr, reg, buffer);
  }

  //specify that we are writing (a register address) to the
  //slave device
  I2CMasterSlaveAddrSet(i2cBase, SlaveAddr, receive);

  //if another master is using the bus, return that the line is busy
  if(I2CMasterBusBusy(i2cBase))
  {
    i2cErrorReset(handle);
    return(I2CERROR_BUSY);
  }

  //specify register to be read on the slave device
  I2CMasterDataPut(i2cBase, reg);

  //send control byte and register address byte to slave device
  I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_SEND_START);

  //do data transfer with slave
  errorGot = transferHandleError(i2cBase, I2C_MASTER_CMD_BURST_SEND_ERROR_STOP);
  if(errorGot != I2CERROR_NONE)
  {
    i2cErrorReset(handle);
    return errorGot;
  }

  receive = true;

  //specify that we are going to read from slave device
  I2CMasterSlaveAddrSet(i2cBase, SlaveAddr, receive);

  for(uint32_t i = 0; i < sizeOfReceive; i++)
  {
    //receive control byte and read from the register we specified earlier
    if(i == 0)
    {
      I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_RECEIVE_START);
    }
    else if(i == sizeOfReceive - 1)
    {
      //finish receive
      I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_RECEIVE_FINISH);
    }
    else
    {
      I2CMasterControl(i2cBase, I2C_MASTER_CMD_BURST_RECEIVE_CONT);
    }

    //do data transfer with slave
    errorGot = transferHandleError(i2cBase, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);
    if(errorGot != I2CERROR_NONE)
    {
      i2cErrorReset(handle);
      return errorGot;
    }
    else
    {
      //return data pulled from specified register
      receivedData [i] = I2CMasterDataGet(i2cBase);
    }
  }

  return I2CERROR_NONE;
}

// Enable and initialize the I2C0 master module.  Use the system clock for
// the I2C module, and calculate speed based off system clock 
// and passed desired speed while enabling the I2C module with the passed base.
// Based off of the firmware function I2CMasterInitExpClk
// that unfortunately doesn't cover Fast speed
static void masterInitExpClk(uint32_t ui32Base, RoveI2C_Speed speed)
{
  uint32_t ui32SCLFreq;
  uint32_t ui32TPR;
  uint32_t ui32I2CClk = getCpuClockFreq();

  //
  // Must enable the device before doing anything else.
  //
  I2CMasterEnable(ui32Base);

  //
  // Get the desired SCL speed.
  //
  if(speed == I2CSPEED_STANDARD)
  {
    ui32SCLFreq = 100000;
  }
  else if(speed == I2CSPEED_FULL)
  {
    ui32SCLFreq = 400000;
  }
  else if(speed == I2CSPEED_FAST)
  {
    ui32SCLFreq = 1000000;
  }
  else //default is the standard speed
  {
    ui32SCLFreq = 100000;
  }

  //
  // Compute the clock divider that achieves the fastest speed less than or
  // equal to the desired speed.  The numerator is biased to favor a larger
  // clock divider so that the resulting clock is always less than or equal
  // to the desired clock, never greater.
  //
  ui32TPR = ((ui32I2CClk + (2 * 10 * ui32SCLFreq) - 1) / (2 * 10 * ui32SCLFreq)) - 1;
  HWREG(ui32Base + I2C_O_MTPR) = ui32TPR;
}

