MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RoveI2C/RoveI2C_TivaTM4C1294NCPDT.cpp
static void initVerifyInput(uint8_t i2cIndex, RoveI2C_Speed speed, uint8_t clockPin, uint8_t dataPin)
{
  if(i2cIndex > 9)
  {
    debugFault("I2c: index out of bounds");
  }
  if(clockPin > 95 || dataPin > 95)
  {
    debugFault("I2c: clock or data pin out of bounds");
  }
  if(speed == I2CSPEED_HIGH)
  {
    debugFault("I2c: High speed not supported");
  }

  uint32_t i2cBase = i2cIndexToI2cBase[i2cIndex];

  //verify that both of the pin inputs correspond to the i2c module chosen by the index 
  if(!(i2cBase == pinMapToI2cBase_Scl[clockPin] && i2cBase == pinMapToI2cBase_Sda[dataPin])) 
  {
    debugFault("I2c: pins did not match i2c module");
  }
}

//attempt to have I2C module do a transfer with slave.
//Returns any errors encountered
static RoveI2C_Error transferHandleError(uint32_t i2cBase)
{
  bool timedOut = false;

  uint64_t mics = micros();

  //wait for MCU to start transaction or it times out
  while(!I2CMasterBusy(i2cBase) && !timedOut)
  {
    timedOut = (micros() - mics > 10000);
  }

  // Wait until MCU is done transferring or it times out.
  while(I2CMasterBusy(i2cBase) && !timedOut)
  {
    //check to see if the clock out bit in the master control register has been set or not; if it has, then
    //the device has held the clock line low for too long and the module needs reset
    timedOut = (HWREG(i2cBase + I2C_O_MCS) & I2C_MCS_CLKTO) > 0 ? true: false;

    if(!timedOut)
    {
      timedOut = (micros() - mics > TIMEOUT_MICROS);
    }
  }

  if(timedOut)
  {
    return(I2CERROR_TIMEOUT);
  }
  else if(I2CMasterErr(i2cBase) == I2C_MASTER_ERR_ADDR_ACK || I2CMasterErr(i2cBase) == I2C_MASTER_ERR_DATA_ACK)
  {
    return(I2CERROR_ACK);
  }
  else if(I2CMasterErr(i2cBase) != I2C_MASTER_ERR_NONE)
  {
    return(I2CERROR_OTHER);
  }
  else
  {
    return(I2CERROR_NONE);
  }
}

//attempts to do data transfer with slave.
//returns any errors encountered.
//If an error is encountered besides timeout, then function will load
//the stop control int into the i2C register to try and get the hardware to do its own error handling.
//Module is frozen if timeout is encountered, so doesn't try in that case.
static RoveI2C_Error transferHandleError(uint32_t i2cBase, uint32_t stopControl)
{
  RoveI2C_Error errorGot;

  //do data transfer with slave
  errorGot = transferHandleError(i2cBase);
  if(errorGot != I2CERROR_NONE && errorGot != I2CERROR_TIMEOUT)
  {
    I2CMasterControl(i2cBase, stopControl);
  }

  return errorGot;
}

static void i2cErrorReset(RoveI2C_Handle handle)
{
  digitalPinWrite(handle.clockPin, HIGH);
  digitalPinWrite(handle.clockPin, LOW);
  digitalPinWrite(handle.clockPin, HIGH);
  digitalPinWrite(handle.clockPin, LOW);
  roveI2cInit(handle.index, handle.speed, handle.clockPin, handle.dataPin);
}
